perf/spaceflight/spaceflight_news_base.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
      phases:
        - name: Ramp
          duration: 300
          arrivalRate: 1
          rampTo: 2
        - name: Ramp
          duration: 300
          arrivalRate: 1
          rampTo: 50
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
    

scenarios:
  - name: base
    flow:
      - get:
          url: '/spaceflight_news'
          qs:
            cached: false

  - name: base_cached
    flow:
      - get:
          url: '/spaceflight_news'
          qs:
            cached: true